{"urls":{"website":["https://anoncrypto.io/"],"technical_doc":["https://www.anonfork.io/whitepaper"],"twitter":["https://twitter.com/ANON_WeAreANON"],"reddit":["https://reddit.com/r/AnonymousBitcoin"],"message_board":[],"announcement":["https://bitcointalk.org/index.php?topic=3822523.0"],"chat":["https://t.me/ANONFork"],"explorer":["https://explorer.anonfork.io/insight/","https://mgnm.rocks/anon/"],"source_code":["https://github.com/anonymousbitcoin"]},"logo":"https://s2.coinmarketcap.com/static/img/coins/64x64/3343.png","id":3343,"name":"ANON","symbol":"ANON","slug":"anon","description":"Launched in September 2018, ANON (a.k.a. Anonymous) describes itself as a cryptocurrency with privacy and masternode features that aims to build upon Bitcoin and other cryptocurrency technologies. The team includes Jake Greenbaum (Jake the CryptoKing) as its founder and advisors such as Steven Nerayoff, Eli Blatt, and Ran Neu-Ner. Similar to cash, ANON reportedly allows the payer and payee to remain anonymous while transacting - Users can selectively anonymize transactions that are made over the network using zk-SNARKs. \r\n\r\nAccording to the team, ANON's shielded addresses keep balances and transactions private and untrackable. Balances and transactions can also be made transparent by using the unshielded addresses. This allows the network to maintain a secure ledger of balances without disclosing the users or amounts involved. Instead of publishing spend-authority and transaction values, the transaction metadata is encrypted and zk-SNARKs are used to prove the integrity of balances and coin supply.\r\n\r\nANON rewards its masternode operators with a portion of the block rewards and allows operators voting rights on community-raised proposals. Proposals can be made by anyone upon payment of 100 ANON, and once passed, these proposals direct the payment of superblocks to fund tertiary initiatives. Although developmental pathing decisions rest with the team, the community is able to directly influence the project via the proposals and voting process.Following the coin-burn in January 2019, there will be a maximum of 20,228,644 ANON that will ever exist, making it a deflationary currency. Find out more at https://anoncrypto.io/","notice":null,"date_added":"2018-09-25T00:00:00.000Z","tags":null,"platform":null,"category":"coin"}