{"urls":{"website":["https://appcoins.io/"],"technical_doc":["https://appcoins.io/assets/images/white-paper.pdf"],"twitter":["https://twitter.com/appcoinsproject"],"reddit":["https://reddit.com/r/AppcoinsProtocol"],"message_board":[],"announcement":["https://bitcointalk.org/index.php?topic=2280664.0"],"chat":[],"explorer":["https://appcexplorer.io/"],"source_code":[]},"logo":"https://s2.coinmarketcap.com/static/img/coins/64x64/2344.png","id":2344,"name":"AppCoins","symbol":"APPC","slug":"appcoins","description":"AppCoins is an open and distributed protocol for app stores based on the Ethereum blockchain and smart contracts. It redesigns app advertising, in-app purchases (IAP), and app approval flows through a circular model. As a higher share of the advertising and IAP revenue is kept within the app ecosystem, more value is retained in the app economy. Being an open protocol, it would theoretically provide more transparency and trust. Multiple app stores can implement and benefit from this and stakeholders will have to contribute to its development and adoption. Furthermore, API integration will streamline implementation.\r\n\r\nAppCoins integrates app stores, users, developers, advertisers, and OEMs. This system is app store agnostic, existing across different mobile platforms (Android & iOS). The different app stores act as oracles of the smart contracts, which are associated with each of the platform’s core transactions. This system creates a trust layer for the economy, obviating the need for intermediaries. AppCoins aims to become the universal language of the app economy.\r\n\r\nThe protocol also includes a so-called Proof-of-Attention system. Users, app stores, and OEMs receive tokens through the Proof-of Attention concept as a reward. Developers that want to advertise their apps can be sure that the user has installed and used it. The users reinvest their tokens via inapp purchases and this would theoretically create a virtuous loop that boosts the AppCoins economic growth.\r\n\r\n- Link to the Source Code: https://github.com/AppStoreFoundation  \r\n- Chat: https://t.me/appcoinsofficial  \r\n- Announcement: https://medium.com/@appcoins \r\n- Source: Official website: https://appcoins.io","notice":null,"date_added":"2018-01-08T00:00:00.000Z","tags":null,"platform":{"id":1027,"name":"Ethereum","symbol":"ETH","slug":"ethereum","token_address":"0x1a7a8bd9106f2b8d977e08582dc7d24c723ab0db"},"category":"token"}