{"urls":{"website":["http://www.beancash.org/"],"technical_doc":["http://beancash.org/about.html"],"twitter":["https://twitter.com/BeanCash_BEAN"],"reddit":[],"message_board":["http://www.bitbean.org/forum/"],"announcement":["https://bitcointalk.org/index.php?topic=969676.0"],"chat":["https://live.beancash.org/teambean/channels/town-square","http://webchat.freenode.net/?channels=#teambean"],"explorer":["https://chainz.cryptoid.info/bitb/","http://aida.ageleis.de/"],"source_code":["https://github.com/TeamBitBean/bitbean-core"]},"logo":"https://s2.coinmarketcap.com/static/img/coins/64x64/819.png","id":819,"name":"Bean Cash","symbol":"BITB","slug":"bean-cash","description":"Bean Cash's mission is \"to be an enduring digital currency, with high integrity, a store of value and a means of exchange for every day transactions -- that stands the test of time!\"  \r\nBean Cash recognizes the original Bitcoin white paper as its guiding principle and is built on core bitcoin technology with inputs from Peercoin for the foundation of its proof-of-stake (PoS) feature.\r\n\r\nThere was no fund-raising or pre-mine; the blockchain (then named BitBean) was launched on 13 February 2015.  After a SHA256 proof-of-work phase, Bean Cash became a pure PoS currency; the block reward is fixed at 1000 Beans plus any transaction fees attached to the transactions included.  This was the first instance of this version of PoS, which the Bean Cash community calls \"Proof of Bean\" (PoB).  Bean Cash' target block time is one minute, with a maximum block size of 20MB.  It is projected to reach its maximum supply of 50 billion beans in 2111.\r\n\r\nThe team consists of volunteers from around the world who donate time and resources to the project.  Team Bean is the greater Bean Cash community, consisting of anyone who has an interest in the technology.  Anyone who can prove they hold 1% or more of the current outstanding Bean Cash may join Bean Core and have a vote in the direction Bean Cash development takes.  The Executive Board consists of 3 Bean Core members who hold 5% or more of the current outstanding Bean Cash.  They rule by consensus.  If a vote is not unanimous, it does not pass.  The Board may overrule suggestions coming from Bean Core or put forward its own suggestions.  The Board can, likewise, be overruled by a 2/3 super-majority of Bean Core.","notice":null,"date_added":"2015-02-18T00:00:00.000Z","tags":["mineable"],"platform":null,"category":"coin"}