{"urls":{"website":["https://crownplatform.com/"],"technical_doc":["https://docs.google.com/document/d/1WE9ikiSieQvyiM0iSY7hJh1h6HXIdQZJFD9jkJPW6dc/edit"],"twitter":["https://twitter.com/CrownPlatform"],"reddit":["https://reddit.com/r/Crown"],"message_board":["https://medium.com/crownplatform/"],"announcement":["https://bitcointalk.org/index.php?topic=815487.0"],"chat":["https://t.me/crownplatform","https://discordapp.com/invite/rB3Kr86"],"explorer":["https://chainz.cryptoid.info/crw/"],"source_code":["https://gitlab.crownplatform.com/crown/crown-core"]},"logo":"https://s2.coinmarketcap.com/static/img/coins/64x64/720.png","id":720,"name":"Crown","symbol":"CRW","slug":"crown","description":"Crown describes itself as a multi-channel scalable Blockchain solution provider leveraging environmentally friendly technology that has been evolving since October 08, 2014, the date of the Genesis Block of Crown.\r\n\r\nCrown aims to provide a complete ecosystem including the ability to create blockchains, smart contract data, governance and scalable analysis for single- or multi-chain custom projects hosted directly within the Crown Platform's network. Crown Platform aims to provide scale benefits with low ecological impact because it is based on the MNPOS protocol, reducing operating costs and carbon footprint.\r\n\r\nCrown Plateform offers specific research, development and production functionalities via NFTs. It aims to offer interoperability of concrete solutions and optimal security within its decentralized network. Users can create DApps, remote programs, various games and move towards a new form of non-fungible interactive chain marketing, laying the foundation for tracking and analyzing data in the global chain. Crown Platform aims to become the ideal multi-channel solution for real, daily, cheap and accessible use at any time.\r\n\r\nThis is now a time of great opportunity to harness the power of Crown to make the exploitation and use of your assets, any value of public data that is not fungible on an unchangeable Blockchain database at any time, accessible.","notice":null,"date_added":"2014-11-08T00:00:00.000Z","tags":["mineable"],"platform":null,"category":"coin"}