{"urls":{"website":["https://www.diviproject.org/"],"technical_doc":["https://wiki.diviproject.org/#whitepaper"],"twitter":["https://twitter.com/DiviProject"],"reddit":["https://reddit.com/r/DiviProject"],"message_board":["https://blog.diviproject.org/"],"announcement":["https://bitcointalk.org/index.php?topic=5039351"],"chat":["https://t.me/diviproject"],"explorer":["https://diviscan.io/"],"source_code":["https://github.com/Divicoin/Divi"]},"logo":"https://s2.coinmarketcap.com/static/img/coins/64x64/3441.png","id":3441,"name":"Divi","symbol":"DIVI","slug":"divi","description":"The Divi Project is a PoS blockchain with the slogan \"Crypto Made Easy\".  The company is focused on bringing cryptocurrency to ordinary users by making it more user-friendly and reducing user error.  \r\n\r\nThe Divi team launched its blockchain on 27 September 2018. The team is reportedly known for inventing the multi-tier masternode concept, and claims to be the only masternode that can be set up from the wallet with a single click using its \"MOCCI\" system.  Divi also has weekly lottery blocks that pay 11 of its stakers. Divi aims to create its own user-friendly \"Chain Lightning\" network that they believe will be more usable than Bitcoin's version.  It will have atomic swaps, an advanced governance system, and a multi-coin wallet that is designed to make Bitcoin and other cryptocurrencies user-friendly too. \r\n\r\nThe Divi Project won third place in the 2018 \"Token Tank\" contest at World Crypto Con in Las Vegas, and also was rated the #3 best Masternode, behind only Dash and PIVX, by Omni Analytics. The Divi team includes four different advisers who speak frequently on the national circuit.  This includes former Yahoo Chief Solutions Officer Tim Sanders, futurist Ramez Naam, former Coin Telegraph CEO Toni Lane Casserly, Doug Scott, former President of Ogilvy Entertainment, and top crypto influencers Joel Comm and Travis Wright from the Bad Crypto Podcast. The Divi team has been interviewed on national television multiple times, including on the floor of the New York Stock Exchange, at NASDAQ, and on Tech Republic.","notice":null,"date_added":"2018-10-12T00:00:00.000Z","tags":["mineable"],"platform":null,"category":"coin"}