{"urls":{"website":["https://iex.ec/"],"technical_doc":["https://iex.ec/app/uploads/2017/04/iExec-WPv2.0-English.pdf"],"twitter":["https://twitter.com/iEx_ec"],"reddit":["https://reddit.com/r/iexec"],"message_board":["https://medium.com/iex-ec"],"announcement":["https://bitcointalk.org/index.php?topic=1746241.0"],"chat":["https://slack.iex.ec/"],"explorer":["https://etherscan.io/token/RLC","https://ethplorer.io/address/0x607f4c5bb672230e8672085532f7e901544a7375"],"source_code":["https://github.com/iExecBlockchainComputing"]},"logo":"https://s2.coinmarketcap.com/static/img/coins/64x64/1637.png","id":1637,"name":"iExec RLC","symbol":"RLC","slug":"rlc","description":"iExec claims to have developed the first decentralized marketplace for cloud computing resources. Blockchain technology is used to organize a market network where users can monetize their computing power, applications, and datasets. By providing on-demand access to cloud computing resources, iExec is reportedly able to support compute-intensive applications in fields such as AI, big data, healthcare, rendering, or FinTech.\r\n\r\nThe iExec network is made up of computing resource providers. Computing power providers are called ‘iExec Workers’. As workers, users can connect their machines and be rewarded in RLC tokens for contributing resources to the network. Application providers can monetize their applications and algorithms. Data providers who own valuable datasets can make them available for use by applications through iExec. The iExec consensus protocol ‘PoCo’ (Proof of Contribution) provides consensus over off-chain computing and can also be used to integrate decentralized oracles with iExec.\r\n\t\r\niExec believes that its strength lies in trusted off-chain computing. Its representative heads the ‘Trusted Compute Working’ group within the Ethereum Enterprise Alliance. It has partnered with Intel to release a 'trusted compute' solution for blockchain (TEE using Intel SGX).  Other iExec collaborators include Alibaba Cloud, IBM, Genesis Cloud, EDF electrical utility company, EEA, and Ubisoft. iExec was one of the contributors to the Trusted Compute Framework (Hyperledger Avalon) alongside Microsoft, Intel, ConsenSys, Envision, PegaSys, and Kaleido. \r\n\r\niExec is working with various organizations and consortiums with the goal of providing scalable, secure and easy access to the services, datasets, and computing resources.","notice":null,"date_added":"2017-04-20T00:00:00.000Z","tags":null,"platform":{"id":1027,"name":"Ethereum","symbol":"ETH","slug":"ethereum","token_address":"0x607f4c5bb672230e8672085532f7e901544a7375"},"category":"token"}