{"urls":{"website":["https://lunes.io/"],"technical_doc":["https://lunes.io/wp-content/themes/lunes/whitepaper/Lunes-Whitepaper-en.pdf"],"twitter":["https://twitter.com/LunesPlatform"],"reddit":["https://reddit.com/r/Lunes"],"message_board":["https://blog.lunes.io/en/"],"announcement":["https://bitcointalk.org/index.php?topic=5126486.0"],"chat":["https://t.me/Lunesnoticias","https://t.me/LunesPlatformEN"],"explorer":["https://blockexplorer.lunes.io/","https://www.lunesfullnode.com/explorer/"],"source_code":["https://github.com/Lunes-platform"]},"logo":"https://s2.coinmarketcap.com/static/img/coins/64x64/3786.png","id":3786,"name":"Lunes","symbol":"LUNES","slug":"lunes","description":"Lunes describes itself as a Brazilian technology company that creates B2B and B2C blockchain solutions. Its services and products aim to democratize finance by offering fundraising, payment methods, and commercial automation using cryptocurrencies\r\n\r\nLunes claims to be the largest cryptocurrency in Latin America. It was developed with the goal of offering total transparency and fast/cheap transactions. Lunes' blockchain is prepared to store and guarantee the security of any kind of information, viz. document authenticity records, digital asset issuance, and execution of smart contracts.\r\n\r\nOn the Lunes' blockchain, the generation time of the key block occurs every 60 seconds; the micro-blocks take a few seconds. It reportedly has the maximum capacity of 65,500 transactions per minute and 1,092 per second. The validation of transactions on the Lunes network occurs through the LPoS (Leased Proof-of-Stake), which the Lunes team believes to be the safest validation scheme for blockchain.\r\n\r\nIn Leased Proof-of-Stake any network participant - who owns more than 5000 Lunes - can become a validator node, contributing to the security and gaining a share of network transaction fees as a reward. In addition, with the leasing system, anyone can join the network as a validator.\r\n\r\nTools already launched in the market:\r\n- Wallet - (https://luneswallet.app/)\r\n- Digital signature - (https://lunestruth.com.br/en/)","notice":null,"date_added":"2019-03-14T00:00:00.000Z","tags":["mineable"],"platform":null,"category":"coin"}