{"urls":{"website":["https://meet.one"],"technical_doc":[],"twitter":["https://twitter.com/MeetDotOne"],"reddit":[],"message_board":["https://medium.com/@MEET.ONE","https://steemit.com/@meetone"],"announcement":[],"chat":["https://t.me/MeetOneEnglish"],"explorer":["https://bloks.io/account/eosiomeetone","https://www.eosx.io/account/eosiomeetone?partner=coinmarketcap"],"source_code":["https://github.com/meet-one/documentation"]},"logo":"https://s2.coinmarketcap.com/static/img/coins/64x64/3136.png","id":3136,"name":"MEET.ONE","symbol":"MEETONE","slug":"meetone","description":"MEET.ONE's goal is to become a unified portal for blockchain users. Its core business includes the MEET.ONE Chain and MEET.ONE wallet. MEET.ONE Chain is designed to promote the development of the EOS ecosystem by lowering the barriers to entry for large scale commercial dApps. The MEET.ONE team aims to empower traditional internet companies by helping them to integrate their business with the blockchain so that users will be able to monetize and exchange the value that they create easily, securely, and freely. \r\n\r\nIn 2019, the team plans to incubate 1-2 projects (with millions of users) that intend to move their businesses onto the MEET.ONE chain. In Q2-2020, the goal is to have over 10M on-chain accounts. The MEET.ONE wallet supports different public blockchains such as EOS and Binance, MEET.ONE, and Cosmos. Additionally, the plan is to allow users to manage, trade, and stake their assets, as well as access dApps and blockchain news. MEET.ONE wallet aims to become a portal for new users to experience the MEET.ONE blockchain. \r\n\r\nThe MEET.ONE team reportedly raised several million dollars in a private sale in 2018 to cover operating expenses for the subsequent 3 years. They were reportedly able to breakeven in November of 2018. The team's self-reported circulating supply is approximately 5B, of which 1B has been locked up on the MEET.ONE chain and re-deployed on the Binance chain.","notice":null,"date_added":"2018-08-10T00:00:00.000Z","tags":null,"platform":{"id":1765,"name":"EOS","symbol":"EOS","slug":"eos","token_address":"eosiomeetone"},"category":"token"}