{"urls":{"website":["https://nectar.community/"],"technical_doc":["https://nectar.community/whitepaper"],"twitter":["https://twitter.com/deversifi"],"reddit":["https://reddit.com/r/deversifi"],"message_board":["https://blog.deversifi.com/introducing-deversifi/"],"announcement":["https://blog.deversifi.com/introducing-nectar-2-0/"],"chat":[],"explorer":["https://etherscan.io/token/0xcc80c051057b774cd75067dc48f8987c4eb97a5e","https://ethplorer.io/address/0xcc80c051057b774cd75067dc48f8987c4eb97a5e"],"source_code":[]},"logo":"https://s2.coinmarketcap.com/static/img/coins/64x64/2538.png","id":2538,"name":"Nectar","symbol":"NEC","slug":"nectar","description":"Nectar was originally launched in 2017 by the Bitfinex spin-off exchange, Ethfinex — a team based out of London, UK — with the purpose of rewarding market makers for the value they create whilst simultaneously serving as the primary voting mechanism, allowing traders to govern the exchange and decide, among other things, which tokens they wish to see listed next. The project was designed to experiment with and develop novel governance processes with the aim of solving pain points seen with centralized exchanges including opaque and costly token listing procedures.  \r\n\r\n\r\nIn August 2019, Ethfinex evolved into DeversiFi, bringing with it an overhaul of the Nectar token. Nectar now serves as the native utility and governance token of decentralised exchange DeversiFi. NEC 2.0 features a buy & burn mechanism, DeversiFi trading fee-discounts, and promotes participation from the wider Blockchain ecosystem through the NecDAO — launching in December 2019 with a reported ~ 17,500ETH constituted for the community-driven allocation of funds and governance of both DeversiFi and Nectar.community.","notice":"Please be aware that Nectar tokens were initially distributed via the Ethfinex exchange and the majority of tokens are still held on the exchange, only those tokens which have been withdrawn and are transferable on the Ethereum blockchain are included in the circulating supply calculation.","date_added":"2018-02-21T00:00:00.000Z","tags":null,"platform":{"id":1027,"name":"Ethereum","symbol":"ETH","slug":"ethereum","token_address":"0xcc80c051057b774cd75067dc48f8987c4eb97a5e"},"category":"token"}