{"urls":{"website":["http://www.neutroncoin.com/"],"technical_doc":["https://www.neutroncoin.com/wp-content/uploads/2018/01/Nucleus-Paper-v2.pdf"],"twitter":["https://twitter.com/Neutron_Crypto"],"reddit":["https://reddit.com/r/NeutronCoin"],"message_board":[],"announcement":["https://bitcointalk.org/index.php?topic=1323468"],"chat":["https://t.me/NeutronCoin","https://discord.gg/NuGTB6z"],"explorer":["http://ntrn.explorer.cryptotools.pw:3001/","http://www.fuzzbawls.pw/explore/Neutron/","http://www.presstab.pw/phpexplorer/NTRN/index.php"],"source_code":["https://github.com/neutroncoin/neutron"]},"logo":"https://s2.coinmarketcap.com/static/img/coins/64x64/894.png","id":894,"name":"Neutron","symbol":"NTRN","slug":"neutron","description":"Launched on 19 April 2015, Neutron is an eco-friendly solution to cryptoassets. Neutron uses the Proof Of Stake consensus algorithm, which allows users to \"stake\" their holdings to generate a passive income in the form of newly-minted Neutron, with no special hardware and very little processing power. \r\n\r\nNeutron features masternode technology that enables a client to receive a higher percentage reward for locking in collateral (25,000 coins). The more Neutron is held in a staking wallet, the higher the weight a client has vis-a-vis the network, which determines the average time in which a block is solved. Neutron also features a Dynamic Reward Reduction with no \"Hard\" \"Halving\" event -  the amount of Daily Neutron created reduces gradually over every one million blocks. \r\n\r\nNeutron is managed and maintained by BitlabLLC out of Arlington Texas, by Theron Rodriguez and Thomas Dowdy, with Thomas Posey (Ok), Rick Caceres (CAN), Adam Waldenberg (Sweden), Jason Hickson (Texas), Eron Villareal (Japan). Neutron's goal is to be usable as an everyday currency via a card-based payment gateway or mobile app service directly from a linked Neutron Wallet.","notice":null,"date_added":"2015-04-21T00:00:00.000Z","tags":null,"platform":null,"category":"coin"}