{"urls":{"website":["https://nos.io"],"technical_doc":["https://nos.io/static/whitepaper.pdf"],"twitter":["https://twitter.com/nOSplatform"],"reddit":["https://reddit.com/r/nOSplatform"],"message_board":["https://medium.com/nos-io"],"announcement":["https://bitcointalk.org/index.php?topic=5054273"],"chat":["https://nos.chat","https://t.me/nOSchat"],"explorer":["https://neotracker.io/contract/c9c0fc5a2b66a29d6b14601e752e6e1a445e088d"],"source_code":["https://github.com/nos"]},"logo":"https://s2.coinmarketcap.com/static/img/coins/64x64/3622.png","id":3622,"name":"nOS","symbol":"NOS","slug":"nos","description":"nOS describes itself as a full-stack solution and decentralized network for application development, deployment, discovery, and interaction. The platform is described as a Virtual Operating System due to the distributed services it aims to offer both developers and end-users. Key features include:\r\n\r\n- Transparent Back-ends: On nOS, applications and websites can reportedly be deployed in an open and decentralized manner by integrating smart contracts, client-side code, and public-key cryptography. Unlike server-side backend code, smart contracts can be open for all to read, allowing users to review how their data will be transmitted before any final commitments to action.\r\n\r\n- Filesystem: Client-side code and other frontend materials can be distributed via nOS Filesystem, a decentralized file sharing protocol that reportedly allows for secure and transparent distribution of static files. \r\n\r\n- Client: Apps that are deployed to nOS can be accessed through nOS Client, a software solution for desktop and mobile that (among other features) introduces nOS Browser. nOS Browser functions as a web browser, which is integrated with the nOS Protocol, a blockchain-powered web protocol that the facilitates secure and open accessibility of nOS apps.\r\n\r\n- Protocol and Name Service: The nOS Protocol resolves domain names that exist on nOS Name Service, a blockchain-powered decentralized implementation of a Domain Name Service, and allows for apps to register domain names which are discoverable on nOS.\r\n\r\n- App Store and Decentralized Authority: The App Store aims to offer a user-friendly discovery platform.\r\n\r\n- Automatic Token Conversion: By integrating crypto-currency exchange APIs, nOS Client is reportedly able to automatically convert primary blockchain platform currencies into the required amount of application tokens that are needed to make specific transactions or invocations.","notice":null,"date_added":"2018-11-30T00:00:00.000Z","tags":null,"platform":{"id":1376,"name":"Neo","symbol":"NEO","slug":"neo","token_address":"c9c0fc5a2b66a29d6b14601e752e6e1a445e088d"},"category":"token"}