{"urls":{"website":["https://rise.vision/"],"technical_doc":["https://downloads.rise.vision/lightpaper.pdf"],"twitter":["https://twitter.com/RiseVisionTeam"],"reddit":["https://reddit.com/r/RiseVision"],"message_board":["https://medium.com/rise-vision"],"announcement":["https://bitcointalk.org/index.php?topic=1445947.0"],"chat":["https://t.me/risevisionofficial"],"explorer":["http://explorer.rise.vision/"],"source_code":["https://github.com/risevision"]},"logo":"https://s2.coinmarketcap.com/static/img/coins/64x64/1294.png","id":1294,"name":"Rise","symbol":"RISE","slug":"rise","description":"RISE offers a platform for Decentralized Applications (DAPPs), powered by a community-driven Delegated Proof of Stake (DPoS) blockchain. It is reportedly maintained by 101-199 Delegates nodes that are elected by the RISE community through voting with their RISE wallets. Elected active Delegates are rewarded for running nodes to secure the network  \r\n\r\nRISE aims to offer developers Software Development Kits (SDKs) to enable the creation of Decentralized Applications (DAPPs). Developers will also be able to interact with the RISE blockchain through Application Programming Interfaces (APIs) in multiple code languages such as TypeScript/JavaScript, Python, C# and JAVA.  RISE claims to be one of the first blockchain projects to have its core codebase written in TypeScript. TypeScript is a strict syntactical superset of JavaScript used for large web development projects. Applications built on RISE will be distributed and decentralized, as a copy of the blockchain will reside on multiple nodes and if one node fails the network can still operate. DAPPs created with RISE development tools will run on RISE sidechains. \r\n\r\nRISE Vision was incorporated as a business in Gibraltar as of December 2017.","notice":"YoBit is currently trading an old chain of RISE. For more information, please <a href=\"https://twitter.com/RiseVisionTeam/status/1134406896985747457/\">click here.</a>\r\n\r\n","date_added":"2016-06-30T00:00:00.000Z","tags":null,"platform":null,"category":"coin"}