{"urls":{"website":["http://syscoin.org"],"technical_doc":["http://syscoin.org/whitepaper.pdf"],"twitter":["https://twitter.com/syscoin"],"reddit":["https://reddit.com/r/SysCoin"],"message_board":[],"announcement":["https://bitcointalk.org/index.php?topic=1466445.0"],"chat":["https://t.me/joinchat/AAAAAEHzByog3h1qutnjhQ"],"explorer":["https://chainz.cryptoid.info/sys/","http://explorer.blockchainfoundry.co/"],"source_code":["https://github.com/syscoin/"]},"logo":"https://s2.coinmarketcap.com/static/img/coins/64x64/541.png","id":541,"name":"Syscoin","symbol":"SYS","slug":"syscoin","description":"Syscoin Platform (SYS) envisages itself to be a scalable blockchain for enterprise, a development platform, and an asset platform offering high throughput, low fees, security, ease of token creation, and cross-chain asset interoperability. It aims to help developers create and implement decentralized applications, as well as facilitate the development of custom decentralized marketplaces,\r\n\r\nSyscoin's \"bridge\" with \"2WP\" (two-way peg using mint/burn) was built to provide bi-directional interoperability without requiring atomic swap nor market demand to operate, thereby granting ease-of-access and continued ownership/integrity of tokens on all involved platforms. Syscoin's protocol stack includes Z-DAG - a consensus layer designed for near-instant, low-cost microtransactions capable of serving point-of-sale. This is combined with SHA256 merge-mined consensus on the mainchain. Syscoin Bridge also aims to enable SPTs (Syscoin Platform Tokens) to utilize capabilities of other platforms, such as smart contracts on Ethereum. Syscoin Protocol also aims to enable more storage-intensive use cases (e.g. decentralized identity, marketplaces) to benefit from blockchain while managing storage through offchain aggregation.","notice":"YoBit is currently trading an old chain of SYS. For more information <a href=\"https://twitter.com/syscoin/status/1033054739250835456\">click here.</a>","date_added":"2014-08-20T00:00:00.000Z","tags":["mineable"],"platform":null,"category":"coin"}