{"urls":{"website":["https://telosfoundation.io/"],"technical_doc":["https://resources.telosfoundation.io/wp_master/telos_white_paper_english.pdf"],"twitter":["https://twitter.com/HelloTelos"],"reddit":["https://reddit.com/r/TelosNetwork"],"message_board":[],"announcement":[],"chat":["https://t.me/HelloTelos"],"explorer":["https://telos.bloks.io/","https://telostracker.io/topHolders"],"source_code":["https://github.com/Telos-Foundation/eosio.contracts/blob/master/LICENSE"]},"logo":"https://s2.coinmarketcap.com/static/img/coins/64x64/4660.png","id":4660,"name":"Telos","symbol":"TLOS","slug":"telos","description":"Telos (TLOS) describes itself as a smart contract blockchain running on EOSIO software. It makes use of Delegated Proof of Stake (DPOS) consensus. TLOS is the native currency of Telos and is used for acquiring resources for decentralized applications (dApps), voting for block producers, worker proposals, election arbitrators and other on chain governance. The governance features used by Telos' core system are available for dApp developers to include in their projects.\r\n\r\nThe Telos blockchain reportedly offers dApp developers 0.5 second block times, transaction rates in excess of 1000 transactions per second, and free transactions. Developers can reportedly build blockchain applications that provide a similar user experience to conventional applications. \r\n\r\nThe blockchain went live in December 2018 using a modified EOS genesis snapshot (the result of the EOS token sale) where all accounts were capped at a maximum of 40000 TLOS. This resulted in a broad and relatively equitable initial distribution of approximately 300 million tokens EOS genesis account holders. 18 million tokens were granted to the founders of the chain and 6 million to the Telos Foundation. The current supply of TLOS is 355 million and token inflation is 0%.","notice":null,"date_added":"2019-09-17T00:00:00.000Z","tags":null,"platform":{"id":1765,"name":"EOS","symbol":"EOS","slug":"eos","token_address":""},"category":"token"}