{"urls":{"website":["https://www.ternio.io"],"technical_doc":[],"twitter":["https://twitter.com/terniotoken"],"reddit":["https://reddit.com/r/TernioToken"],"message_board":["https://medium.com/@ternio"],"announcement":["https://bitcointalk.org/index.php?topic=3309385.0"],"chat":["https://t.me/ternio_token"],"explorer":["https://stellar.expert/explorer/public/asset/TERN-GDGQDVO6XPFSY4NMX75A7AOVYCF5JYGW2SHCJJNWCQWIDGOZB53DGP6C"],"source_code":[]},"logo":"https://s2.coinmarketcap.com/static/img/coins/64x64/2876.png","id":2876,"name":"Ternio","symbol":"TERN","slug":"ternio","description":"Launched on 01/01/18, by a team based in the United States, Ternio aims to accelerate the use of blockchain and cryptocurrency into everyday life by providing white-label technology to enterprise clients that gives blockchain and cryptocurrency real-world application.  With its two products Lexicon and BlockCard, Ternio has reportedly addressed the issues related to blockchain scalability and payment utility of cryptocurrency.  \r\n\r\nTernio’s patent-pending blockchain framework called Lexicon is reportedly 3rd party verified at over 1 million transactions per second and is used by enterprise clients in high transaction environments.  In 2019, Ternio was announced as an Amazon Advanced Tech Partner due to this scalability. \r\n\r\nTernio’s crypto debit card called BlockCard gives consumers real-world spending power of cryptocurrency anywhere VISA is accepted.  BlockCard can reportedly be used at 46 million merchants worldwide or at ATMs to withdraw cash.  Cardholders get a virtual card as well as physical card mailed to them that can be used anywhere VISA is accepted. \r\n\r\nTERN is the payment token used on Lexicon and BlockCard.\r\n\r\nTernio is based in Charlotte, NC and Atlanta, GA.   For more information on the TERN token and Ternio products please visit Ternio.io and GetBlockCard.com.","notice":null,"date_added":"2018-06-26T00:00:00.000Z","tags":null,"platform":{"id":512,"name":"Stellar","symbol":"XLM","slug":"stellar","token_address":"GDGQDVO6XPFSY4NMX75A7AOVYCF5JYGW2SHCJJNWCQWIDGOZB53DGP6C"},"category":"token"}